[
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/scent-premium-hotel/hotel/hanoi-vn.html",
        "name": "Scent Premium Hotel",
        "address": "31 Hang Hanh, Hoan Kiem, Ha Noi, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,5",
        "number of reviewers": "(571 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dịch vụ phòng [24 giờ]"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập, spa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/the-bloom-hn/hotel/hanoi-vn.html",
        "name": "The Bloom Hà Nội (The Bloom Hanoi)",
        "address": "36 Dich Vong Hau Street, Dich Vong Hau Ward, Cau Giay District, Hanoi , Quận Cầu Giấy, Hà Nội, Việt Nam, 11310",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(351 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bữa sáng [miễn phí]",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-topaz/hotel/da-coc-vn.html",
        "name": "Khách Sạn & Spa Grande Collection (Grande Collection Hotel & Spa)",
        "address": "46 - 48 Bat Su Hoan Kiem Hanoi, Phố Cổ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(756 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/scent-premium-hotel/hotel/hanoi-vn.html",
        "name": "Scent Premium Hotel",
        "address": "31 Hang Hanh, Hoan Kiem, Ha Noi, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,5",
        "number of reviewers": "(571 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dịch vụ phòng [24 giờ]"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập, spa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-victor-gallery-hotel-spa/hotel/hanoi-vn.html",
        "name": "Hanoi Victor Gallery Hotel & Spa ",
        "address": "93-95B Hang Gai Streets, Hang Gai Ward, Hoan Kiem distict, 10, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(108 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bữa sáng [miễn phí]"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-graceful-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn Graceful Hà Nội (Hanoi Graceful Hotel)",
        "address": "21 Hàng Phèn, Hoàn Kiếm, Phố Cổ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(2.206 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/lotte-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Lotte Hotel Hanoi",
        "address": "54 Liễu Giai, Quận Ba Đình, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,1",
        "number of reviewers": "(4.424 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bể bơi ngoài trời ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/acoustic-hotel-spa_2/hotel/hanoi-vn.html",
        "name": "Khách Sạn & Spa Acoustic (Acoustic Hotel & Spa)",
        "address": "39 Tho Nhuom,Hoan Kiem, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(3.713 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 500 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/golden-sun-suites-hotel/hotel/hanoi-vn.html",
        "name": "Golden Sun Suites Hotel",
        "address": "35 Hang Quat, Hoan Kiem District, Phố Cổ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(1.332 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, phòng tập và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/old-quarter-hotel-1961-h9754836/hotel/hanoi-vn.html",
        "name": "Khách Sạn Old Quarter 1961 (Old Quarter Hotel 1961)",
        "address": "6/22 Hang Voi Street- Ly Thai To- Hoan Kiem- Ha Noi, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(363 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày",
            "Dịch vụ phòng [24 giờ]",
            "Quán bar"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Như một lợi ích thêm, nhà hàng có sẵn ngay trong khuôn viên nghỉ để phục vụ nhu cầu của quý khách một cách thuận tiện."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/movenpick-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Khách sạn Movenpick Hà Nội (Movenpick Hotel Hanoi)",
        "address": "83A Lý Thường Kiệt, Quận Hoàn Kiếm , Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(2.006 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 310 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Ngoài tiêu chuẩn ALLSAFE, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-daewoo-hotel/hotel/hanoi-vn.html",
        "name": "Hanoi Daewoo Hotel",
        "address": "Số 360, Phố Kim Mã, Quận Ba Đình, Quận Ba Đình, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(2.520 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bể bơi ngoài trời và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/grand-vista-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Grand Vista Hà Nội (Grand Vista Hanoi)",
        "address": "146 Giảng Võ, Quận Ba Đình, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9",
        "number of reviewers": "(336 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/the-bloom-hn/hotel/hanoi-vn.html",
        "name": "The Bloom Hà Nội (The Bloom Hanoi)",
        "address": "36 Dich Vong Hau Street, Dich Vong Hau Ward, Cau Giay District, Hanoi , Quận Cầu Giấy, Hà Nội, Việt Nam, 11310",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(351 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bữa sáng [miễn phí]",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/poonsa-duy-tan-apartment/hotel/hanoi-vn.html",
        "name": "Khách sạn và Căn hộ dịch vụ Poonsa Duy Tân (Poonsa Duy Tan Hotel and Serviced Apartment)",
        "address": "Lot D2/D6, No. 05 Tho Thap Street, Dich Vong Hau Ward, Cau Giay District, Quận Cầu Giấy, Hà Nội, Việt Nam, 11310",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(50 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/dcapitale-studio-lake-view-hanah-hometel/hotel/hanoi-vn.html",
        "name": "Căn hộ 38 m² 1 phòng ngủ, 1 phòng tắm riêng ở Trung Hòa Nhân Chính (Dcapitale Studio lake view Hanah Hometel)",
        "address": "Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,8",
        "number of reviewers": "(1 nhận xét)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 5 sao này có bể bơi ngoài trời giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/western-hanoi-boutique-hotel/hotel/hanoi-vn.html",
        "name": "Khách Sạn Western Hà Nội Boutique (Western Hanoi Boutique Hotel)",
        "address": "Số 66, phố Khúc Thừa Dụ, Cầu Giấy, Hà Nội, Việt Nam, Quận Cầu Giấy, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,2",
        "number of reviewers": "(14 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-la-siesta-hotel-and-spa/hotel/hanoi-vn.html",
        "name": "Hanoi La Siesta Hotel and Spa",
        "address": "94 Mã Mây, Hoàn Kiếm, Hà Nội, Phố Cổ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(1.428 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và phòng xông ướt ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-imperial-hotel/hotel/hanoi-vn.html",
        "name": "Khách Sạn & Spa Imperial (Imperial Hotel & Spa)",
        "address": "44 Phố Hàng Hành, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(550 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/sojo-hotel-ga-ha-noi/hotel/hanoi-vn.html",
        "name": "Khách sạn SOJO Ga Hà Nội (SOJO Hotel Ga Hanoi)",
        "address": "115 Tran Hung Dao Str, Hoan Kiem Dist, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,9",
        "number of reviewers": "(10 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 100 m",
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Rèm che ánh sáng",
            "Quán bar"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4 sao này có phòng tập giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/22land-residence/hotel/hanoi-vn.html",
        "name": null,
        "address": null,
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-royal-palace-hotel-2_2/hotel/hanoi-vn.html",
        "name": "KHÁCH SẠN HÀ NỘI ROYAL PALACE 2 (HANOI ROYAL PALACE HOTEL 2)",
        "address": "Phố Cổ, 95 Hàng Bông, Hoàn Kiếm, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,5",
        "number of reviewers": "(798 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 990 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Nằm ở trung tâm Hà Nội",
            "Wi-Fi miễn phí trong tất cả các phòng!"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, phòng tập và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-topaz/hotel/da-coc-vn.html",
        "name": "Khách Sạn & Spa Grande Collection (Grande Collection Hotel & Spa)",
        "address": "46 - 48 Bat Su Hoan Kiem Hanoi, Phố Cổ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(756 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/western-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Western Hanoi Hotel",
        "address": "Ngõ 75, phố Trần Thái Tông, Câu Giấy, Hà Nội, Việt Nam, Quận Cầu Giấy, Hà Nội, Việt Nam, 70000",
        "stars": "5",
        "ratings": "7,6",
        "number of reviewers": "(279 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, nhà hàng và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/istay-hotel-apartment-2/hotel/hanoi-vn.html",
        "name": "Khách sạn Căn hộ iStay 2 (iStay Hotel Apartment 2)",
        "address": "Số 12, ngõ 39 Đình Thôn, Mỹ Đình 1, Nam Từ Liêm, Hà Nội, Mỹ Đình, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(266 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Mỹ Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Như một lợi ích thêm, nhà hàng có sẵn ngay trong khuôn viên nghỉ để phục vụ nhu cầu của quý khách một cách thuận tiện."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/dcapitale-studio-h32001671/hotel/hanoi-vn.html",
        "name": null,
        "address": null,
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-graceful-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn Graceful Hà Nội (Hanoi Graceful Hotel)",
        "address": "21 Hàng Phèn, Hoàn Kiếm, Phố Cổ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(2.206 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/shining-central-hotel-and-spa/hotel/hanoi-vn.html",
        "name": "Khách Sạn và Spa Shining Central (Shining Central Hotel and Spa)",
        "address": "20 Phố Lò Sũ, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,3",
        "number of reviewers": "(756 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng xông khô, phòng tập và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/anatole-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Anatole Hotel Hanoi",
        "address": "26-28-30 Nha Chung Str., Hoan Kiem Dist, Hanoi, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,1",
        "number of reviewers": "(437 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng xông khô, phòng xông ướt và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/le-grand-hanoi-hotel-the-oriental/hotel/hanoi-vn.html",
        "name": "Khách sạn Le Grand Hà Nội - The Oriental (Le Grand Hanoi Hotel - The Oriental)",
        "address": "6 Ngõ 80 Trần Duy Hưng, Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9",
        "number of reviewers": "(164 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/solaria-hanoi/hotel/hanoi-vn.html",
        "name": "Khách sạn Solaria Hà Nội (Solaria Hanoi Hotel)",
        "address": "22 Phố Báo Khánh, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(1.176 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và phòng xông ướt ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/cozy-green-amazing-apart-vinhomes-green-bay/hotel/hanoi-vn.html",
        "name": "Chung cư studio 30 m² có 1 phòng tắm riêng ở Trung Hòa Nhân Chính (ZIN HOUSE & NICE VIEW @Cozy & Green & Amazing)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,9",
        "number of reviewers": "(11 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/la-sinfonia-del-rey-hotel-and-spa/hotel/hanoi-vn.html",
        "name": "La Sinfonia del Rey Hotel and Spa",
        "address": "Hàng Dầu, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(893 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bồn tắm nước nóng và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/apartment-with-2bedroom-2min-to-lotte-tower/hotel/hanoi-vn.html",
        "name": null,
        "address": null,
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/adodda-vinhome-green-bay/hotel/hanoi-vn.html",
        "name": "Chung cư studio 28 m² có 1 phòng tắm riêng ở Trung Hòa Nhân Chính (ADODDA Vinhome Green Bay)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,8",
        "number of reviewers": "(4 bài đánh giá)",
        "facilities": [
            "Điều hòa",
            "Phòng tập",
            "Thang máy",
            "Bãi để xe",
            "Đồ vải lanh"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có bãi đỗ xe miễn phí. Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/eternity-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Khách Sạn Eternity Hà Nội (Eternity Hanoi Hotel)",
        "address": "32 Yết Kiêu, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 70000",
        "stars": "5",
        "ratings": "7,7",
        "number of reviewers": "(843 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 330 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/le-grand-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn Le Grand Hà Nội (Le Grand Hanoi Hotel)",
        "address": "1B9 Dam Trau, Bach Dang, Hai Ba Trung dist., Quận Hai Bà Trưng, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(650 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Bãi biển riêng",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hai Bà Trưng của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/maya-boutique-hotel-spa/hotel/hanoi-vn.html",
        "name": "Khách Sạn & Spa Maya Boutique (Maya Boutique Hotel & Spa)",
        "address": "20 Dao Duy Tu, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(436 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/modern-2br-top-floor-skylake-next-to-keangnam/hotel/hanoi-vn.html",
        "name": "Chung cư 70 m² 2 phòng ngủ, 2 phòng tắm riêng ở Mỹ Đình (Modern 2BR Top floor Skylake next to Keangnam)",
        "address": "Mỹ Đình, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(2 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Mỹ Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-emerald-waters-hotel-valley/hotel/hanoi-vn.html",
        "name": "Khách sạn Emerald Waters Hà Nội (Hanoi Emerald Waters Hotel Valley)",
        "address": "22 Lò Sũ, Lý Thái Tổ, Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,1",
        "number of reviewers": "(219 bài đánh giá)",
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Hanoi Hotel",
        "address": "D8, Phố Giảng Võ, Quận Ba Đình, Quận Ba Đình, Hà Nội, Việt Nam,                     ",
        "stars": "5",
        "ratings": "8,1",
        "number of reviewers": "(1.079 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/intercontinental-hanoi-westlake/hotel/hanoi-vn.html",
        "name": "InterContinental Hồ Tây Hà Nội (InterContinental Hanoi Westlake)",
        "address": "5 Từ Hoa, Quận Tây Hồ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,5",
        "number of reviewers": "(2.133 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Xông khô",
            "Phòng xông ướt"
        ],
        "description": "Ngoài tiêu chuẩn IHG Clean Promise, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Tây Hồ của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bể bơi ngoài trời và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/viva-s-house-24-vinhomes-greenbay-1brhanoi/hotel/hanoi-vn.html",
        "name": "Chung cư 28 m² 1 phòng ngủ, 1 phòng tắm riêng ở Trung Hòa Nhân Chính (Viva’s House 24 @Vinhomes GreenBay @1brHanoi)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,5",
        "number of reviewers": "(47 bài đánh giá)",
        "facilities": [
            "Điều hòa",
            "Phòng tập",
            "Thang máy",
            "Bãi để xe",
            "Đồ vải lanh"
        ],
        "description": "Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/essence-d-orient-hotel-spa/hotel/hanoi-vn.html",
        "name": "Khách sạn Silk trung tâm Hà Nội (Hanoi Center Silk Hotel)",
        "address": "22A Tạ Hiện Street, Phố Cổ, Quận Hoàn Kiếm, Hà Nội, Phố Cổ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,9",
        "number of reviewers": "(1.041 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/beautiful-clean-green-house-luxury-1br-balcony/hotel/hanoi-vn.html",
        "name": "Chung cư 32 m² 1 phòng ngủ, 1 phòng tắm riêng ở Trung Hòa Nhân Chính (ZIN HOUSE @NICE VIEW @BEAUTIFUL & CLEAN &LUXURY)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9",
        "number of reviewers": "(15 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/la-siesta-premium-hang-be/hotel/hanoi-vn.html",
        "name": "La Siesta Premium Hàng Bè Hà Nội (Hanoi La Siesta Premium Hang Be)",
        "address": "27 Hang Be, Phố Cổ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(1.172 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/blue-hanoi-inn-city-hotel/hotel/hanoi-vn.html",
        "name": "Blue Hanoi Inn City Hotel",
        "address": "7A Tú Mỡ, Trung Hòa, Cầu Giấy, Hà Nội, Việt Nam, Quận Cầu Giấy, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,6",
        "number of reviewers": "(441 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/poonsa-cau-giay-apartment_2/hotel/hanoi-vn.html",
        "name": "Căn hộ Dịch Vụ Khách sạn Poonsa Cầu Giấy (Poonsa Cau Giay Hotel Serviced Apartment)",
        "address": "No. 58, Truong Cong Giai Street, Dich Vong Hau Ward, Cau Giay District, Hanoi, Quận Cầu Giấy, Hà Nội, Việt Nam, 113000",
        "stars": "5",
        "ratings": "9,3",
        "number of reviewers": "(22 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-brilliant-hotel-and-spa/hotel/hanoi-vn.html",
        "name": "Khách sạn & Spa Brilliant Hà Nội (Hanoi Brilliant Hotel and Spa)",
        "address": "44 Hàng Trống, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,1",
        "number of reviewers": "(1.122 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và phòng xông ướt ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/muong-thanh-grand-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn Mường Thanh Grand Hà Nội (Muong Thanh Grand Hanoi Hotel)",
        "address": "CC2, Bắc Linh Đàm, Quận Hoàng Mai, Quận Hoàng Mai, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "6,9",
        "number of reviewers": "(110 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hoàng Mai của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/d-el-dorado-apartment/hotel/hanoi-vn.html",
        "name": null,
        "address": null,
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/pentstudio-west-lake-hanoi/hotel/hanoi-vn.html",
        "name": "PentStudio Tây Hồ Hà Nội (PentStudio West Lake Hanoi)",
        "address": "699 Lac Long Quan Street, Phu Thuong Ward Tay Ho District,, Quận Tây Hồ, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,6",
        "number of reviewers": "(155 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Xông khô",
            "Phòng xông ướt"
        ],
        "description": "Ngoài tiêu chuẩn Ascott Cares, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Tây Hồ của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, xông khô và phòng xông ướt ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/lieber-hotel-2/hotel/hanoi-vn.html",
        "name": "Khách Sạn Lieber 2 (Lieber Hotel 2)",
        "address": "04 Yen Phuc, Ha Dong, Hanoi, Quận Hà Đông, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(179 bài đánh giá)",
        "facilities": [
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dọn phòng hằng ngày",
            "Rèm che ánh sáng",
            "Quán bar"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hà Đông của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/54a-nguyen-chi-thanh-vinhomes-2-bdr/hotel/hanoi-vn.html",
        "name": "Chung cư 83 m² 2 phòng ngủ, 2 phòng tắm riêng ở Quận Đống Đa (Dcapitale next to Charmvit Tower/ 2BR /bathtub)",
        "address": "Quận Đống Đa, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [
            "Bồn tắm nước nóng",
            "Điều hòa",
            "Phòng tập",
            "Thang máy",
            "Đồ vải lanh"
        ],
        "description": "Nằm ở vị trí trung tâm tại Quận Đống Đa của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/moon-west-lake-serviced-apartment/hotel/hanoi-vn.html",
        "name": "Căn Hộ Dịch Vụ MOON West Lake (MOON West Lake Serviced Apartment)",
        "address": "Quận Tây Hồ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(222 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dọn phòng hằng ngày",
            "Dịch vụ giặt là"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Tây Hồ của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4.5 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/la-passion-hanoi-hotel-spa/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa La Passion Hà Nội (La Passion Hanoi Hotel and Spa)",
        "address": "26 Hàng Thùng, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "10",
        "number of reviewers": "(9 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bữa sáng [miễn phí]"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, nhà hàng và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/pan-pacific-hanoi/hotel/hanoi-vn.html",
        "name": "Pan Pacific Hanoi",
        "address": "Số 1, Đường Thanh Niên, Quận Ba Đình, Quận Tây Hồ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(1.873 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Xông khô",
            "Phòng xông ướt"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Tây Hồ của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/halais-hotel_2/hotel/hanoi-vn.html",
        "name": "Khách Sạn Halais (Halais Hotel)",
        "address": "48 Tran Nhan Tong,Hai Ba Trung, Quận Hai Bà Trưng, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,7",
        "number of reviewers": "(726 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Dọn phòng hằng ngày",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Hai Bà Trưng của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/london-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Khách Sạn & Spa Luân Đôn Hà Nội (London Hanoi Hotel)",
        "address": "Ngõ 45, phố Trần Thái Tông, quận Cầu Giấy, Hà Nội, Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "7,9",
        "number of reviewers": "(174 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bồn tắm nước nóng, phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/t-housing-1-one-bedroom-apartment-in-linh-lang/hotel/hanoi-vn.html",
        "name": "Chung cư 45 m² 1 phòng ngủ, 1 phòng tắm riêng ở Quận Ba Đình (T HOUSING✯LUXURY APARTMENT NEAR LOTTE BADINH ✯)",
        "address": "Quận Ba Đình, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "2",
        "number of reviewers": "(1 nhận xét)",
        "facilities": [
            "Bồn tắm nước nóng",
            "Điều hòa",
            "Bể bơi riêng",
            "Phòng tập",
            "Thang máy"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có bãi đỗ xe miễn phí. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/lakeside-superb-modern-city-view-wifi-tv-2brs/hotel/hanoi-vn.html",
        "name": "Chung cư 55 m² 2 phòng ngủ, 1 phòng tắm riêng ở Quận Cầu Giấy (Vinhome D'Capitale✨Lakeview & Modern✨2Brs)",
        "address": "Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [
            "Điều hòa",
            "Phòng tập",
            "Khu vực hút thuốc",
            "Thang máy",
            "Đồ vải lanh"
        ],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/grand-dragon-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Khách Sạn Grand Dragon Hà Nội (Grand Dragon Hotel Hanoi)",
        "address": "21 Le Van Luong Street, Nhan Chinh Ward, Thanh Xua District, Hanoi City, Vietnam, Trung Hòa Nhân Chính, Hà Nội, Việt Nam, 84",
        "stars": "5",
        "ratings": "8,5",
        "number of reviewers": "(264 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Dọn phòng hằng ngày",
            "Quán bar"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/pearl-hotel-nguyen-chanh/hotel/hanoi-vn.html",
        "name": "OYO 1158 khách sạn Ngọc Trai (OYO 1158 Ngoc Trai hotel)",
        "address": "72-74 Nguyễn Chánh, Phường Trung Hòa, Quận Cầu Giấy, Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "7,4",
        "number of reviewers": "(21 bài đánh giá)",
        "facilities": [
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày",
            "Dịch vụ phòng [24 giờ]",
            "Thang máy",
            "Dịch vụ phòng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-sahul-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa A25 (A25 Hotel & Spa)",
        "address": "684 Minh Khai, Quận Hai Bà Trưng, Hà Nội, Việt Nam, 0844",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(347 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng",
            "Xông khô",
            "Phòng xông ướt"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Hai Bà Trưng của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/grand-plaza-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Grand Plaza Hanoi Hotel",
        "address": "117 Trần Duy Hưng, Quận Cầu Giấy, Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,2",
        "number of reviewers": "(1.667 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/paradise-boutique-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa Hà Nội Paradise (Ha Noi Paradise Hotel & Spa)",
        "address": "62 Phố Hàng Bạc, Quận Hoàn Kiếm, Phố Cổ, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,8",
        "number of reviewers": "(1.144 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/melia-bavi-mountain-retreat_2/hotel/hanoi-vn.html",
        "name": "Khu nghỉ dưỡng Melia Núi Ba Vì (Melia Bavi Mountain Retreat)",
        "address": "Ba Vi, Ba Vì, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(396 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Ba Vì của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bể bơi ngoài trời ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/bon-house-vinhomes-skylake-2br-aprt-near-keangnam/hotel/hanoi-vn.html",
        "name": "Chung cư 70 m² 2 phòng ngủ, 2 phòng tắm riêng ở Mỹ Đình (BON HOUSE# VINHOMES SKYLAKE 2BR APRT*NEAR KEANGNAM)",
        "address": "Mỹ Đình, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "7,9",
        "number of reviewers": "(8 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Mỹ Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hilton-hanoi-opera_4/hotel/hanoi-vn.html",
        "name": "Hilton Hanoi Opera",
        "address": "Số 1, Phố Lê Thánh Tông, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(1.316 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Bồn tắm nước nóng",
            "Xông khô",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy thực hiện hành trình tuyệt vời nhất của quý khách tới Hà Nội với tiêu chuẩn Hilton CleanStay đã cam kết và tận hưởng bãi đỗ xe miễn phí. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/meracus-ii-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Mercury Central Hanoi Hotel",
        "address": "32 Hàng Trống, Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,3",
        "number of reviewers": "(1.105 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dịch vụ phòng [24 giờ]"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng nhà hàng và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/tram-anh-hotel-ha-noi/hotel/hanoi-vn.html",
        "name": "Khách sạn Trâm Anh Hà Nội HANZ (HANZ Tram Anh Hotel Hanoi)",
        "address": "1b Trung Yen 15, Trung Hoa, Cau Giay, Quận Cầu Giấy, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "7,4",
        "number of reviewers": "(20 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dọn phòng hằng ngày",
            "Dịch vụ phòng [24 giờ]"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/delicacy-central-hotel-spa/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa Aurora Premium (Aurora Premium Hotel & Spa)",
        "address": "61 Hàng Bè, Hoàn Kiếm, Hà Nội, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,3",
        "number of reviewers": "(473 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/pegasy-suites-lakeside/hotel/hanoi-vn.html",
        "name": "Pegasy Suites Lakeside",
        "address": "Số 33, ngõ 399, đường Âu Cơ, phường Nhật Tân, Quận Tây Hồ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,1",
        "number of reviewers": "(53 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Rèm che ánh sáng"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Tây Hồ của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 5 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hillary-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Hillary Hanoi Hotel",
        "address": "70 TRUONG CONG GIAI, CAU GIAY, HA NOI, Quận Cầu Giấy, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,9",
        "number of reviewers": "(153 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/unnamed-property-h28738976/hotel/hanoi-vn.html",
        "name": null,
        "address": null,
        "stars": "5",
        "ratings": null,
        "number of reviewers": null,
        "facilities": [],
        "description": null
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-emerald-waters-hotel-trendy_2/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa Oriana Boutique (Oriana Boutique Hotel and Spa)",
        "address": "38 phố Lò Sũ, khu phố cổ, Quận Hoàn Kiếm, thành phố Hà Nội, Việt Nam, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,2",
        "number of reviewers": "(1.443 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, xông khô và spa ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/mina-hotel-spa/hotel/hanoi-vn.html",
        "name": "Mina Hotel and Spa",
        "address": "P. Hàng Buồm, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,8",
        "number of reviewers": "(43 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, spa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/chi-s-house-vinhomes-royal-city-r4/hotel/hanoi-vn.html",
        "name": "Chung cư 106 m² 2 phòng ngủ, 2 phòng tắm riêng ở Trung Hòa Nhân Chính (Chi's house#5 - Vinhomes Royal city- 2 bedroom)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,4",
        "number of reviewers": "(3 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà và bể bơi ngoài trời ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/a-homes-green-bay-luxury-apartment-5/hotel/hanoi-vn.html",
        "name": "Chung cư studio 30 m² có 1 phòng tắm riêng ở Trung Hòa Nhân Chính (Vinhomes Green Bay Luxury Apartment 1.5)",
        "address": "Trung Hòa Nhân Chính, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9",
        "number of reviewers": "(10 bài đánh giá)",
        "facilities": [],
        "description": "Nằm ở vị trí trung tâm tại Trung Hòa Nhân Chính của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, bể bơi ngoài trời và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hotel-du-monde/hotel/hanoi-vn.html",
        "name": "Hotel du Monde",
        "address": "89 Hoang Nhu Tiep, Qaận Long Biên, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(111 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bữa sáng [miễn phí]",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Qaận Long Biên của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, spa và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hotel-de-l-opera-hanoi-mgallery-collection_2/hotel/hanoi-vn.html",
        "name": "Khách Sạn De l'Opera Hà Nội - Mgallery (Hotel de l'Opera Hanoi - Mgallery)",
        "address": "Số 29 Phố Tràng Tiền, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,5",
        "number of reviewers": "(935 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Xông khô",
            "Điều hòa"
        ],
        "description": "Ngoài tiêu chuẩn ALLSAFE, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/novotel-hanoi-thai-ha/hotel/hanoi-vn.html",
        "name": "Novotel Hà Nội Thái Hà (Novotel Hanoi Thai Ha)",
        "address": "2 Thai Ha Street Dong Da District, Quận Đống Đa, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,1",
        "number of reviewers": "(113 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Xông khô"
        ],
        "description": "Ngoài tiêu chuẩn ALLSAFE, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Đống Đa của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bể bơi ngoài trời và bồn tắm nước nóng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/reddoorz-plus-near-vietnam-museum-ethnology/hotel/hanoi-vn.html",
        "name": "RedDoorz Plus gần Công Viên Cầu Giấy (RedDoorz Plus near Cau Giay Park)",
        "address": "B13-D6, Alley 75 Tran Thai Tong Street, Quận Cầu Giấy, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "7,8",
        "number of reviewers": "(33 bài đánh giá)",
        "facilities": [
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa",
            "Dịch vụ phòng [24 giờ]",
            "Thang máy",
            "Nhà hàng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Như một lợi ích thêm, nhà hàng có sẵn ngay trong khuôn viên nghỉ để phục vụ nhu cầu của quý khách một cách thuận tiện."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/aira-boutique-hanoi-hotel/hotel/hanoi-vn.html",
        "name": "Khách sạn và Spa Aira Boutique Hà Nội (Aira Boutique Hanoi Hotel and Spa)",
        "address": "38A Tran Phu, Ba Dinh, Hanoi, Quận Ba Đình, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(969 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 720 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Ba Đình, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng mát-xa, bể bơi ngoài trời và xông khô ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/dream-hotel-apartment/hotel/hanoi-vn.html",
        "name": "Khách sạn và Căn hộ Dream (Dream Hotel and  Apartment)",
        "address": "64 Nguyen Luong Bang, Quận Đống Đa, Hà Nội, Việt Nam, 04",
        "stars": "5",
        "ratings": "8,5",
        "number of reviewers": "(245 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Đống Đa của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/rose-garden-residences/hotel/hanoi-vn.html",
        "name": "Căn hộ Rose Garden (Rose Garden Residences)",
        "address": "170 Ngọc Khánh, Ba Đình, Quận Ba Đình, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(732 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Xông khô",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi ngoài trời, xông khô và phòng tập ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/arl-kim-ma-no-1/hotel/hanoi-vn.html",
        "name": "Khách Sạn La Batisse Kim Mã (La Batisse Kim Ma Hotel)",
        "address": "143 Kim Ma, Quận Ba Đình, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,3",
        "number of reviewers": "(296 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Dọn phòng hằng ngày",
            "Dịch vụ giặt là"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Ba Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/panda-hotel-h10298623/hotel/hanoi-vn.html",
        "name": "Khách sạn C'bon (C'bon Hotel)",
        "address": "No. 1A, 26 Lane, Do Quang Street, Quận Cầu Giấy, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "8,6",
        "number of reviewers": "(104 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Rèm che ánh sáng"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này được trang bị các tiện nghi ngay trong khuôn viên để nâng cao chất lượng và niềm vui cho kỳ nghỉ của quý khách."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/muong-thanh-grand-xa-la/hotel/hanoi-vn.html",
        "name": "Muong Thanh Grand Xa La",
        "address": "Số 66, đường Phúc La, Văn Phú, Hà Đông , TP Hà Nội, Việt Nam, Quận Hà Đông, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "7,2",
        "number of reviewers": "(60 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bồn tắm nước nóng",
            "Xông khô",
            "Phòng xông ướt"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hà Đông của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng bể bơi trong nhà, mát-xa và bể bơi ngoài trời ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/mercure-hanoi-la-gare-hotel/hotel/hanoi-vn.html",
        "name": "Mercure Hanoi La Gare Hotel",
        "address": "94 Lý Thường Kiệt, Quận Hoàn Kiếm, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,2",
        "number of reviewers": "(475 bài đánh giá)",
        "facilities": [
            "Cách phương tiện công cộng 230 m",
            "Đưa đón sân bay",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Ngoài tiêu chuẩn ALLSAFE, tất cả khách đều được truy cập Wi-Fi miễn phí trong tất cả các phòng và đỗ xe miễn phí nếu đến bằng ô tô. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 4 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/hanoi-bonsella-hotel/hotel/hanoi-vn.html",
        "name": "Hanoi Bonsella Hotel",
        "address": "Số 3 Ngõ Bảo Khánh, Quận Hoàn Kiếm, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "9,4",
        "number of reviewers": "(1.367 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Dọn phòng hằng ngày"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Quận Hoàn Kiếm, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3.5 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/marina-hotel-hanoi/hotel/hanoi-vn.html",
        "name": "Marina Hotel Hanoi",
        "address": "22 phố Miếu Đầm, phường Mễ Trì, quận Nam Từ Liêm, Mỹ Đình, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "8,2",
        "number of reviewers": "(39 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bữa sáng [miễn phí]",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Mỹ Đình của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Được xếp hạng 3.5 sao, chỗ nghỉ chất lượng cao này cho phép khách nghỉ sử dụng phòng tập và nhà hàng ngay trong khuôn viên."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/granda-cau-giay-apartment_2/hotel/hanoi-vn.html",
        "name": "Căn hộ dịch vụ Granda Cầu Giấy (Granda Cau Giay Apartment)",
        "address": "Quận Cầu Giấy, Hà Nội, Việt Nam",
        "stars": "5",
        "ratings": "8,8",
        "number of reviewers": "(290 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Bồn tắm nước nóng",
            "Điều hòa"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Cầu Giấy của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4.5 sao này có bồn tắm nước nóng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/green-hadong-hotel/hotel/hanoi-vn.html",
        "name": "Green Hadong Hotel",
        "address": "Số 1, ngõ 36 Lê Trọng Tấn, Phường La Khê, Quận Hà Đông, Hà Nội, Quận Hà Đông, Hà Nội, Việt Nam, 10000",
        "stars": "5",
        "ratings": "7,7",
        "number of reviewers": "(65 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Bữa sáng [miễn phí]",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hà Đông của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 4 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/romantique-hotel-de-hanoi/hotel/hanoi-vn.html",
        "name": "Romantique Hotel De Hanoi",
        "address": "35-37 Bat Su, Hang Bo, Hoan Kiem, Ha Noi, Phố Cổ, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,6",
        "number of reviewers": "(5 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Nằm ở trung tâm Hà Nội",
            "Đổi ngoại tệ",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Điều hòa"
        ],
        "description": "Hãy để chuyến đi của quý khách có một khởi đầu tuyệt vời khi ở lại khách sạn này, nơi có Wi-Fi miễn phí trong tất cả các phòng. Nằm ở vị trí chiến lược tại Phố Cổ, cho phép quý khách lui tới và gần với các điểm thu hút và tham quan địa phương. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3.5 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    },
    {
        "city": "Hà Nội",
        "url": "https://www.agoda.com/vi-vn/opera-house-suites/hotel/hanoi-vn.html",
        "name": "Opera House Suites (Opera House Suites )",
        "address": "Ngõ Tràng Tiền, Quận Hoàn Kiếm, Hà Nội, Việt Nam, 100000",
        "stars": "5",
        "ratings": "9,3",
        "number of reviewers": "(130 bài đánh giá)",
        "facilities": [
            "Đưa đón sân bay",
            "Wi-Fi miễn phí trong tất cả các phòng!",
            "Đổi ngoại tệ",
            "Điều hòa",
            "Dọn phòng hằng ngày"
        ],
        "description": "Đỗ xe và Wi-Fi luôn miễn phí, vì vậy quý khách có thể giữ liên lạc, đến và đi tùy ý. Nằm ở vị trí trung tâm tại Quận Hoàn Kiếm của Hà Nội, chỗ nghỉ này đặt quý khách ở gần các điểm thu hút và tùy chọn ăn uống thú vị. Đừng rời đi trước khi ghé thăm Pho Co nổi tiếng. Chỗ nghỉ 3 sao này có nhà hàng giúp cho kỳ nghỉ của quý khách thêm thư thái và đáng nhớ."
    }
]